In [6]:
#Realizar la conexion a la BBDD employees
import pymysql
import pandas as pd
try:
	conexion = pymysql.connect(host='localhost',
                             user='root',
                             password='',
                             db='employees')
   print('hpa')
	print("Conexión correcta")
except (pymysql.err.OperationalError, pymysql.err.InternalError) as e:
	print("Ocurrió un error al conectar: ", e)
   print('hpña')

Conexión correcta

In [ ]:
#Obtenemos los datos de la tabla employees
#Al finalizar escribimos la sentencia 'except' para continuar con la conexión activa
try:
    with conexion.cursor() as cursor:
        cursor.execute("SELECT * FROM employees;") # En este caso no necesitamos limpiar ningún dato
        employees = cursor.fetchall() # Con fetchall traemos todas las filas
        for emp in employees: # Recorrer e imprimir
            print(emp)
except:
    print('No se pudo realizar la consulta')

In [4]:
"""
Pasamos los EMPLEADOS (totales) a un dataframe
"""
emp = "SELECT * FROM employees"
df = pd.read_sql_query(emp,conexion)
df.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [ ]:
#Obtenemos los datos de la tabla employees que sean mujeres
#Al finalizar escribimos la sentencia 'except' para continuar con la conexión activa
try:
    with conexion.cursor() as cursor:
        consulta = "SELECT * FROM employees WHERE gender ='F';"
        cursor.execute(consulta)
        employees = cursor.fetchall() # Con fetchall traemos todas las filas
        for emp in employees: # Recorrer e imprimir
            print(emp)
except:
    print('No se pudo realizar la consulta')

In [7]:
"""
Pasamos las EMPLEADAS mujeres a un dataframe
"""
mujeres = "SELECT * FROM employees WHERE gender ='F';"
df_mujeres = pd.read_sql_query(mujeres,conexion)
df_mujeres.head()

   emp_no  birth_date first_name  last_name gender   hire_date
0   10002  1964-06-02    Bezalel     Simmel      F  1985-11-21
1   10006  1953-04-20     Anneke    Preusig      F  1989-06-02
2   10007  1957-05-23    Tzvetan  Zielinski      F  1989-02-10
3   10009  1952-04-19     Sumant       Peac      F  1985-02-18
4   10010  1963-06-01  Duangkaew   Piveteau      F  1989-08-24

In [ ]:
#Obtenemos los datos completos de los departamentos
#Al finalizar escribimos la sentencia 'except' para continuar con la conexión activa
try:
    with conexion.cursor() as cursor:
        cursor.execute("SELECT * FROM departments;")
        departments = cursor.fetchall() # Con fetchall traemos todas las filas
        for dept in departments: # Recorrer e imprimir
            print(dept)
except:
    print('No se pudo realizar la consulta')

In [6]:
"""
Pasamos los DEPARTAMENTOS a un dataframe
"""
deptos = "SELECT * FROM departments"
df_deptos = pd.read_sql_query(deptos,conexion)
df_deptos.head()

  dept_no         dept_name
0    d009  Customer Service
1    d010      Data Science
2    d005       Development
3    d002           Finance
4    d003   Human Resources

In [7]:
#Obtener la cantidad de empleados
 
cursor= conexion.cursor() 
cantidad_total = cursor.execute("SELECT * FROM employees")  
print('La cantidad total de empleados es ', cantidad_total)

La cantidad total de empleados es  300024

In [8]:
#Obtener la cantidad de empleadas mujeres
 
cursor= conexion.cursor() 
cantidad_mujeres = cursor.execute("SELECT * FROM employees WHERE gender ='F';")   
print('La cantidad de mujeres es ', cantidad_mujeres)

La cantidad de mujeres es  120051

In [2]:
#Agregar el departamento Ciencias de Datos.
try:
    conexion = pymysql.connect(host='localhost',
                             user='root',
                             password='',
                             db='employees')
    try:
        with conexion.cursor() as cursor:
            consulta = "INSERT INTO departments(dept_no, dept_name) VALUES (%s, %s);"
            #Podemos llamar muchas veces a .execute con datos distintos
            cursor.execute(consulta, ('d010', 'Data Science'))
            #cursor.execute(consulta, ())
        conexion.commit()
        print('Ejecución correcta')
    except:
        print('No se pudo realizar la consulta')
except (pymysql.err.OperationalError, pymysql.err.InternalError) as e:
    print("Ocurrió un error al conectar: ", e)

Ejecución correcta

In [3]:
#Insertamos al empleado Pepe
try:
    with conexion.cursor() as cursor:
        consulta = "INSERT INTO employees(emp_no, birth_date, first_name, last_name, gender, hire_date) VALUES (%s, %s, %s, %s, %s, %s);"
        #Podemos llamar muchas veces a .execute con datos distintos
        cursor.execute(consulta, (300025, '1985-03-03','Pepe', 'Sanchez','M','2010-05-05'))
            
    conexion.commit()
    
    print('Ejecución correcta')

except:
    print('No se pudo realizar la consulta')

Ejecución correcta

In [4]:
#Asignamos a Pepe como gerente del departamento Ciencia de Datos
try:
    with conexion.cursor() as cursor:
        consulta = "INSERT INTO dept_manager(emp_no, dept_no, from_date, to_date) VALUES (%s, %s, %s, %s);"
        #Podemos llamar muchas veces a .execute con datos distintos
        cursor.execute(consulta, (300025, 'd010', '2015-05-05' ,'2021-11-01'))
            
    conexion.commit()
    print('Ejecución correcta')

except:
    print('No se pudo realizar la consulta')

Ejecución correcta

In [5]:
#Eliminamos al empleado Pepe
#Cerramos la conexion
try:
    with conexion.cursor() as cursor:
        consulta = "DELETE FROM employees WHERE first_name = 'Pepe';"
        cursor.execute(consulta)
        
    conexion.commit()
    print('Ejecución correcta')

finally:
    conexion.close()

Ejecución correcta